import os, io
from google.cloud import vision
import pandas as pd
import glob
import time
import difflib
from fuzzywuzzy import fuzz
import smtplib
import ssl
from email.message import EmailMessage
from email.mime.text import MIMEText
from email.mime.image import MIMEImage
from email.mime.multipart import MIMEMultipart

os.environ['GOOGLE_APPLICATION_CREDENTIALS'] = "STEMVISION\code\imageprocessing\ServiceAccountToken.json"

client = vision.ImageAnnotatorClient()

list_of_images = ''
images_list_empty = False
last_image_time = ''
image_path = ''
latest_image_time = ''

nameList4 = [['กุลปริยา ยุธิษยานุวัฒน์', 'ณัฎฐ์ภัทร์ ฤกษ์สมโภชน์', 'ณัฐกานต์ ธรรมวราภิรมย์', 'ณัฐวรา แย้มประเสริฐ', 'nan กุลภาศักดิ์', 'ปุณณภัสสร ทรงสุโรจน์', 'รักตะวัน ทวีลาภ', 'สวรรยา ดิษฐ์ปรีชา', 'สิรินทรา รุ่งเรือง', 'อาริษา ทองทักษ์', 'จิรายุ บุญเรือง', 'ชญนัทธ เทียมเมือง', 'ฐานวุฒิ เศรษฐวรพันธุ์', 'ณฐกฤษณ์ มหาวินิจฉัยมนตรี', 'ณัฐพฤกษ์ ศักดาภิพาณิชย์', 'แดนบดินทร์ วงศ์ผดุงธรรม', 'บุริศร์ วังอนานนท์', 'ปิติ เล้ากอบกุล', 'พุฒิสรรค์ คุโรปกรณ์พงษ์', 'ภควัต โรจน์โมสิก', 'ภวัต ลิลาพันธิสิทธิ', 'รพีพงศ์ แหล่งสนาม', 'วีรชน ใหม่นาเพียง', 'สิทธิภาคย์ อัศวสถาพรผล'], ['เจนิสา โล', 'ชัญญา จิรภาวสุทธิ์', 'ธัญญารัตน์ อรุโณศรีสกุล', 'ธันยากานต์ ศิริไพรวัน', 'นิชาภา จัมปากะนันท์', 'พิชญ์ณิยา สิทธิฤทธิ์กวิน', 'พิมพ์นภัทร มาตรสุริย์', 'พุฒิพร เจริญวิมลรักษ์', 'ภูมิใจ เรืองสินทรัพย์', 'สายวรรณศิลป เสียงหลาย', 'จิรภัทร นามวงศ์', 'ชนกนนท์ กองกันทะ', 'ชุติเทพ อ๋อง', 'ณฐภัทร ลาภธีรวุฒิ', 'ธนกฤต เชื้อสกุลวนิช', 'ธราดล จิตซื่อ', 'นวปฎล ศิริพรม', 'พงศ์พีระ เลิศสีมาพร', 'พัทธดนย์ จิตติไพบูลย์', 'มัทธิว เหมะ', 'รัชพล ศรีทอง', 'ล้ำตะวัน พยัพตรี', 'วชิรวิทย์ ทองย้อย', 'ศิริอานันท์ บุญประสิทธิพันธ์'], ['ชนกวนัน รอดพิทักษ์', 'ชาคริยา วุฒิยาสาร', 'ณชนกช์ วุฒิไกรรัตน์', 'ณภัทร ปล้องแก้ว', 'ณัชชา ดาวเรือง', 'นพรดา ชูเหล็ก', 'ภิญญาพัชญ์ ซิมธวัธชัย', 'รมย์พิชญา ชินาพิสุทธิ์', 'กิติภูมิ ใหม่แก้ว', 'จิรัฎฐ์ อังกลมเกลียว', 'ชยพล แก้วชัยเจริญกิจ', 'ฐิประภัทธ์ เลิศประเสริฐภากร', 'ณัฐกิตติ์ วรรณภิญโญชีพ', 'ณัฐเจษฎ์ ฝอยทอง', 'ณัฐพัชร์ ฉันทโรจน์ศิริ', 'ปภังกร พงคพนาไกร', 'ภูวเดช ประยุรธเนศ', 'รพีพงศ์ ตั้งมหาสถิตกุล', 'รุจิภาส โอภาสพงศ์พิพัฒน์', 'ศุภกร วงษ์กุหลาบ', 'ศุภวิชญ์ ลักษณะวิลาศ', 'สิรวิชญ์ ยกย่อง', 'สุรพงษ์ บุญสม', 'อินทัช ถาวรพันธ์'], ['พีรชญา ลิ้มมหาคุณ', 'กชพร ธรรมรงค์กุล', 'ติณณา ธรรมรักษา', 'นภสร โตสุโขวงศ์', 'ปาณิศรา ชำนาญศิลป์', 'ปาริชา สิงห์กัญญา', 'พีรยา แซ่เจีย', 'ภวิภา อ่องพัฒนกุล', 'ภัคธิมา โรจน์กิจจานุรักษ์', 'อภิชญา อนุมานไพศาล', 'กรภัทร ลิจุติภูมิ', 'กษิดิ์พิชญ์ วิภาตะรักษ์', 'กิตติคม สุขบัว', 'กิตติธัช เทียนโพธิวัฒน์', 'ณฐกร สวัสดิ์นพรัตน์', 'ณัฐพัชร์ เชื้อกิตติศักดิ์', 'นวพรรษณ์ กริชจนรัช', 'นันทเมธ ศรีงาม', 'นิธิศ อ่วมทอง', 'ปภังกร ธีรปิติกุล', 'ปรัชญ์วิรุฬ เพทัย', 'ภัทรพล เจริญสุขโสภณ', 'ภีมพงษ์ เลี้ยงประยูร', 'รัฐศิลป์ ศรีศรานนท์', 'วริทธิ์ ส่งศรี'], ['กชกร จิตรานุรักษ์เจริญ', 'ชณาภัช ชวศิริกุลฑล', 'ธัญญรัศม์ จิริณีธรรมกุล', 'ปารีณา สถิตธรรมนิตย์', 'พนัชกร ผิวทองงาม', 'พิชชาพร เพชรพรหม', 'รติญา ภูธรธราช', 'กฤษฎิ์ นวลทอง', 'กันตพัฒน์ ศีลประชาวงศ์', 'คณพศ เล่งเวหาสถิตย์', 'ชุติเทพ สิรินทรโสภณ', 'ณภัทร สุทธิศรี', 'ปรีชากร ยาสมร', 'พิสิษฐ์ การสูงเนิน', 'พีรดนย์ แซ่จึง', 'พีรวัส จำจด', 'ภาคภูมิ สรณาคมน์', 'รัชชานนท์ ธีระตระกูลชัย', 'ศรัณย์ อยู่ร่วมใจ', 'ศุภกร เล่งเวหาสถิตย์', 'สิรภัทร นามแก้ว', 'สุทธศิลป์ คุณมงคลวุฒิ', 'หริษฐ์ อรุณศิริกุล', 'อัศม์เดช ชุมเกตุ'], ['จิตภินันท์ โพธิ์อ่อนจรูญ', 'ชนกนันท์ ภูกาบิน', 'ปุญยวีร์ พิทยาวงศ์อานนท์', 'พัชรชา อากาศวิภาต', 'พัชร์พิชา เลิศวิสิฐพล', 'พัณณพัชร ถิรจิตโต', 'ภิญญาพัชญ์ ไพบูลย์', 'วศินี วิมลศิลปวิญญู', 'วิรากร มะโนนัย', 'ชัยดิฐ ลิ่มกาญจนโชติ', 'ชาตโยดม อู่วุฒิพงษ์', 'ณธารธรรม หมื่นนารายณ์', 'ณัชพล พานิช', 'เตชทัต เล้าสืบสกุล', 'ภพธร พูนศรีอร่าม', 'ยศวีร์ วรภาสไพบูลย์', 'รติ มหามงคล', 'วงศ์วริศ ศิลปพิพัฒน์', 'วัชรวิชญ์ หนูสลุง', 'เวชพิสิฐ กวยานนท์', 'ศุภณัฐ สีรัง', 'สิทธา ศรีรัตนพงษ์', 'สุนิรุตติ์ ภาวงศ์กาฬสินธุ์', 'เอื้อวงศ์ อนันตพฤทธิ์'], ['กชพรรณ แก้วสังข์', 'กิริฎา ก่อเกียรติ', 'ชาคริยา อนุทรงศักดิ์', 'นภัสสา กันตังกุล', 'ปนัณญา สังข์แก้ว', 'ปราณิศา พิลัย', 'พรนัชชา อนุรักษ์', 'พลอยชมพู พรรณราย', 'พูลสิริ ฤกษ์ยาม', 'ภูริชญา พรพาณิชพันธุ์', 'วิภาวี มะโนนัย', 'ก่ออิชย์กรณ์ ์ฉาย', 'จิรกร นวลศิริ', 'เจตนิพัทธ์ บุญนำ', 'ณัฐภัทร วิศิษฎ์วรณัฐ', 'ธาม ลีลาเชี่ยวชาญกุล', 'ปกรณ์เกียรติ อิทธิเวชช์', 'พชรกร สวัสดี', 'ภาสวิชญ์ วงค์เมฆ', 'รัฐนันท์ ข้องสาย', 'วชิรวิทญ์ คงเสรีนุสรณ์', 'ศิวัช สังขดิษฐ์', 'สิงหา หวันสะแหละ', 'สิรวิชญ์ อัศวพงษ์เกษม'], ['กชพรรณ สิงห์โห', 'กัญญาพัชร หยู่หนูสิงห์', 'ณัฏฐณิชา เลิศศรีสกุลรัตน์', 'ทอฝัน เลิศวรรณวิทย์', 'ทอแสง แสงอรุณ', 'นิตา จงไกรจักร', 'วชิรญา ยงกุลวณิช', 'วาราดา จงจิระวงศา', 'ศุภาวีร์ บรรเทิง', 'อายะ พ่วงทรัพย์', 'กรเอก สุวรัตนานนท์', 'กฤติภัทร เลิศติรสิน', 'กิตติธัช วงษ์สุวรรรัตน์', 'กิตติภพ เขียนสา', 'เจตนิพิฐ ตุงคสวัสดิ์', 'ชนทิวา ชนม์ชนกบุญ', 'ชวกร จีนสุกแสง', 'ชวิศ ชัชชวลิตสกุล', 'ชัยเกษมอนันต์ เจนกุลนิษฐ์', 'เดชพสิษฐ์ คมพิพัฒน์พงศ์', 'ตรัย อึ้งวิศิษฎ์วงศ์', 'ธนภัทร ทองคำ', 'ธนเสฐฐ์ กิตติวรรธโนทัย', 'รัญชน์ มากมาย'], ['จิรัชญา ศรีใหม่', 'ชัญญา ไชยอาดูล', 'ณัฐภัค ทองแท้', 'นลินนิภา พุฒพวง', 'พรลภัส แซ่ซั่ว', 'พิมพ์ ศรีพัฒน์พิริยกุล', 'สิดารัศมิ์ สุบงกช', 'สิมิลัน คงกฤตยาพันธ์', 'คณพศ ทิวัฑฒานนท์', 'ชฎิลธร ลาภทรงสุข', 'ชยพล เลิศงามมงคลกุล', 'ณภัทร์ ไคโตะ โอชิไอ', 'ณัฐเศรษฐ ทวีรัตนพาณิชย์', 'ธีริทธิ์ ตันติโรจนาเมธ', 'นนทพัทธ์ ชุ่มมงคล', 'nan อัศวรุ่งเรืองชัย', 'ผลิตโชค พนมวงศ์ตะวัน', 'พลกฤต ศุภผล', 'พิชญะ แสงรุ่งคงคา', 'พิศณุพงศ์ ภูเดช', 'ภวิศวร์ วณิชชากร', 'วรัท โสพัศสถิตย์', 'วริศ เตชะทวีกุล', 'สิทธิพร สิงห์นลินธร'], ['คัณธรัตน์ พินพิสิทธิ์', 'ชนัญชิดา หนูฤทธิ์', 'ฐิติกาญจน์ บดินทร์ฐิติกุล', 'รพี พลเดช', 'นวิยา ดีจักรวาล', 'ปัณณสา พงศ์สิงหโชติ', 'วรพร อักโข', 'สุพิชชา ฉันทวรางค์', 'อชิรญาณ์ สุวรรณรัตน์', 'ธเนษฐ อมรจิรพร', 'ธรณ์ธันย์ ปรีชาติวงศ์', 'ธีรเสฏฐ์ สุริยฉัตรกุล', 'นนทวัชร์ หอสุวรรณานนท์', 'ปัณณพงศ์ กีรติอนันต์พร', 'พชร ลิ่มไตรรัตน์', 'พีรบูรณ์ เคียงธนสมบัติ', 'ภาสกร วราจิตติชัย', 'รัชพล ธรรมจาโร', 'ศิรสิทธิ์ หวังผล', 'ศิวกร ต๊ะกำเนิด', 'สุทธิทัต สานสุวรรณ', 'สุรชัย ห่วงรัตน์', 'สุวภัทร สำรวจเบญจกุล', 'อภินัทธ์ งามพันธุ์ไพศาล']]
nameList5 = [['หฤทัยชนก พงศ์ธนเกียรติ', 'กัลยกร เฮงจิตตระกูล', 'กุมภา จุล์', 'ณัชชา หอบรรลือกิจ', 'ณัฐกาญจน์ ตรัยไชยาพร', 'nan พฤทธิพัฒนพงศ์', 'พบพร ตั้งบุญสุข', 'พิมพ์ชนก อู่สันติวงศ์', 'nan ครองศรัทธา', 'กฤติน บัวสังข์', 'คณิศร กิรติพงษ์วุฒิ', 'จิรายุ พรมเผ่า', 'ชนตน นิรัติสัยไตรรัตน์', 'ชนม์นิธิศ ชินาพิสุทธิ์', 'ทยากร ตั้งศรีวงศ์', 'ธาวิน เลาหะพงษ์พันธ์', 'ธิติ สันติลินนท์', 'ธิติพันธ์ เทพสุทิน', 'นิธิวิทย์ โรจนรักษ์', 'ภาณุพัฒน์ ศรีสุขวสุ', 'รุจิภาส ธรรมวิโรจน์ศิริ', 'วิริยกานต์ คีรีวิเชียร', 'ศรชนม์ ศรีชูนิ่ม', 'ศุภวิชญ์ จิระเดชะ', 'อชิรวิศ มหิทธิกร'], ['nan วิกุลชัยกิจ', 'กิรณา ว่องนิติธรรม', 'จิราภา เกียรติกูลขจร', 'ชัญญพัชร์ เอ็งอุทัยวัฒน์', 'ธริตา โศภิษฐิกุล', 'เปมิกา ณ ระนอง', 'พชรกมล วัฒนศิริ', 'ลักษิกาน์ บุญเจริญ', 'อริสรา รุ่งเรือง', 'ชวิน คุณมงคลวุฒิ', 'ณฐภัทร ไชยพานิช', 'ณภัทร สิงห์ตาก้อง', 'ณัฐชานนท์ รองเดช', 'ณัฐสิทธิ์ เกื้อเส้ง', 'ทีฆภัฏ ทรัพย์รวงทอง', 'ธชทัต เทพจินดา', 'บุญรักษา บุญเลิศ', 'ปกป้อง สท้านวงศ์', 'ปณิธาน วีระโอฬารกุล', 'ปณิธิ โลภาส', 'ปรินทร์วริศร์ ปังประเสริฐกุล', 'ปลื้มปิติ คล้อยอรุณ', 'ศุภวิชญ์ สันนิธิลาวัณย์', 'สธรรดร บดีการ'], ['กัญชพร แจ้งโห้', 'ณรฎา จะชาลี', 'รีย์ ชัยสัมฤทธิ์ผล', 'เทียนกมล ทองคง', 'ปภาวรินทร์ พรคงเจริญ', 'า สุทธิจิต', 'พิมพาสุข อัศวราชันย์', 'อภิสุตา อัคเนตร', 'ไอริณรยา พิทักษ์วงษ์', 'ก้องกิดากร แก้วกำเหนิดพงษ์', 'กันต์ธร ไข่มุกข์', 'ฉัทปนัย ชาวคอนไชย', 'ชารีฟ หมัดอาดัม', 'ณวัฒน์ จินดาวิจักษณ์', 'ณัทพงศ์ พันเสรีวงศ์', 'ทินกฤต แต้ตระกูล', 'ปจิต เรียบร้อย', 'พัฐนนท์ เอี่ยมพงษ์ไพฑูรย์', 'รดิศ มั่นเจริญพร', 'สุภวัฒก รัตนเมกุล', 'สุรมิศ บุญสม', 'อิทธิกร หลีกภัย', 'อิทธิพัทธ์ เณรบำรุง', 'เอกภัทร ภู่ประภา'], ['เกวลิน กลักวงศ์', 'ธนัชญา สรรเพชญ', 'บุณยวีร์ วิริยวงวานศ์', 'ไพลิน ตั้งสุนทรวิวัฒน์', 'ยุทธิดา แสงศรี', 'ศิริภัสสร รักษสุธากาญจน์', 'หฤทชนัน สัมพันธ์ชัยวสุ', 'อภิสรา กาวิกุล', 'อรกัญญา สมรมิตร', 'nan มิ่งคำเลิศ', 'กฤดนท ผลอนันต์', 'กฤตรัฐ ทิพย์สุนทรศักดิ์', 'คุณานนต์ นาใจคง', 'ชญานิน จงอัศญากุล', 'ชัยพัฒน์ รัชตภูษิต', 'ชาติภัทร มาสุข', 'ณชพล พลเยี่ยม', 'ณัฐวัฒน์ ขาวสะอาด', 'ธนวัตน์ ตันวัฒนะ', 'นันทพัทธ์ พิทยาวงศ์อานนท์', 'ปรเมศวร์ แสงแก้วสุข', 'ภัทรพล ใจเย็น', 'สาวิตร อภินันท์มงคล', 'สิริดนย์ รังษีหิรัญรัตน์'], ['คณัสนันท์ อัครภาณิชย์กร', 'ชุตินันต์ สุขพงศ์จิรากุล', 'นัสวรรณ รุ่งฤทธิเดช', 'บัว ังสิกุล', 'ปภาดา เจริญสิทธิ์', 'พาขวัญ บุญประกายแก้ว', 'มทินา บุญเต็ม', 'อนัญญา ไชยนพกุล', 'กานต์ชนก วัชรินทร์กาญจน์', 'กิตติโชติ อวยพรชัยกุล', 'กุณฑี สมบูรณ์วิวัฒน์', 'ติณณภัชน์ ศรีเพ็ง', 'ธัญวิสิฏฐ์ สุธรรมเกษม', 'ธาวินธรณ์ เหง้าพรหมมินทร์', 'ธีร์ ครุพงศ์', 'ปัณณวิชญ์ จตุภูมิเดชา', 'พัทธดนย์ เพ่งพินิจ', 'ภวิศ จตุวีรวงศ์', 'รฐนนท์ มกรมณี', 'วงศกร มาลาลักษมี', 'ศิวกร สองรักษ์', 'อธิษฐ์ วิสุทธิ์นนท์นาถ'], ['อินทเศรษฐ์ อุปทินเกตุ'], ['กัญญาพัชร ร่วมรัตนตรัย', 'จินตนันท์ โตทับเที่ยง', 'ชนิดาภา ทองบ่อ', 'ณัชชา ชัยสัมฤทธิ์ผล', 'ณัฏฐ เลิศสิริมั่นคง', 'ภา ฉัตร', 'ธนัชพร เชยบัวแก้ว', 'ปราวีณา พรมสี่หน้า', 'อันนา แสงแก้ว', 'กรวิชญ์ กรทิพย์', 'เกียรติสุรนันท์ ศรีพลไกร', 'คุณชนิต ด้วงปลี', 'จารุกิตติ์ มัลลิกะนาวิน', 'ณัฐนพพงศ์ จงสุขไกล', 'ธนภัทร จารุพันธุ์', 'บรมคุณ หลาบหนองแสง', 'พงศกร โลหะศิริวัฒน์', 'พีรพัฒน์ เหล่าวีระธรรม', 'ภัคพิพัฒน์ เอี่ยมพงษ์ไพฑูรย์', 'ภาคิน ตีรวัฒนประภา', 'วิศรุต จงภิญโญตระกูล', 'สรวิศ ก่อกิจกุศล', 'สิรภพ กำแหงคุมพล', 'สิรภพ กิจค้า'], ['จินตวรรณ เวทย์ศุรกฤต', 'ณภัค วิทยาดี', 'นวินดา โชติธนประสิทธิ์', 'ปณิตา วานิชพงษ์พันธุ์', 'ปัณดารีย์ ฟูดุลยวัจนานนท์', 'ภัณฑิรา เฉื่อยกระโทก', 'สิราวรรณ พันธุ์อนุกูล', 'อู่อุขวัญ เจริญกุล', 'กายชิสส์ สุวรรณเนตร', 'กิตติชนม์ ชาวนาวิก', 'กิตติพศ แก้วปลั่ง', 'จิรกิตติ์ จิระเจริญรัตน์', 'ชยุต จุนถิระพงศ์', 'ชวินธร แสงเพชร', 'ณัฐธนนท์ ปิติเจริญพันธ์', 'ธนกฤต อุ้ยเอ้ง', 'ธนิสร จารุดิลกกุล', 'ธีรทัต วีระเศรษฐ์ศิริ', 'บรรณวัฒน์ สิรภัทรชัยวงศ์', 'ภัทรชัย ศาสตรานุรักษ์', 'ภูเบศ แจ้งศรีเสริฐ', 'มั่นมโน เหลี่ยมดี', 'วาทิศ คงชาญแพทย์', 'วีรภัทร ปัญญามัง'], ['กมลชนก บุญเลิศวรกุล', 'กัญญาภัค ร่วมรัตนตรัย', 'ฐิมาภรณ์ ศิริรัตน์', 'ณัชชนา เเก้วจำนงค์', 'ณัฐช์ วาสุเทพรักษ์', 'ธัญธิตา ปานเนาว์', 'นิชนิภา สาธิตธรรมพร', 'พิมพ์ภัทรา เล่ห์มงคลไชย', 'กมลวิช ปลายเนิน', 'กริชเพชร โคตรหลักคำ', 'กัณฐกะ ณรงค์การดี', 'จิรัฏฐ์ ฉัตรศรีนพคุณ', 'ณฐศร ถิระพร', 'ทรงฤทธิ์ ทรัพย์เย็น', 'นวพล ธรรมกฤษดา', 'ปริชญ์ เลิศยิ่งยศ', 'ปฤณ ภูวรกิจ', 'ปัณณวิชญ์ เฉลิมเลิศปัญญา', 'ปียวิชญ์ วงศ์งาม', 'พณิช กมลาพร', 'ฟ้าสรรค์ เชื้อผู้ดี', 'ภูมิพิรัชย พันพินิจ', 'ศุภวิชญ์ บางอ้อ', 'สิริวิชฐ์ รอดอนันต์'], ['จินต์ธามนต์ พิภูพัชญ์ชา', 'ณัฐฐิรา อุดมสิทธิพันธุ์', 'ทิพมาศ จุ้ยมีนวล', 'ธมกร ศรีสวัสดิ์', 'นัทธมน ภควัตมงคล', 'พิมพ์มาดา เหวรารักษ์', 'ศรุตา ศรีเจริญ', 'อติกานต์ ชุติมากุล', 'กวินภพ จันเจือ', 'กษิดิ์เดช จูห้อง', 'เฉลิมภรพจน์ กาญจนวรงค์', 'ณภัทร ด่านชนะ', 'ธีร์ธวัช พิมพา', 'ธีร์ธวัช นิลละออ', 'ธีรัตม์ สันติลินนท์', 'ปัณณวิชญ์ วรภาสไพบูลย์', 'ปุญญพร โค้ววชิระเมธาสกุล', 'พีรวิชญ์ องค์น้ำทิพย์', 'วชิรภัทร อินทรชาติ', 'ศุภวิชญ์ ลิ้มวิภาวีอนันต์', 'สรรค์ธนัท วังประเสริฐ', 'สิรวิชญ์ พิพิธธนาบรรพ์', 'หิรัณย์ เฮงโรจนโสภณ', 'อมรฤทธิ์ ศิริคำ'], ['กีรติกา ทองชัยประสิทธิ์', 'ฐิติพร สมบูรณ์', 'ณัฐกานต์ อริยสัจจากร', 'ธฤตวรรณ ชูแก้ว', 'ภัสนันท์ สัมฤทธิ์สุทธิ์', 'รัชวลัญช์ อุณเวทย์วานิช', 'วรวลัญช์ กิตติศิริประพันธ์', 'อาริสา จันต๊ะหล้า', 'จิรวัฒน์ อมรโอภาสเสถียร', 'ชิษณุพงศ์ ทรัพย์เย็น', 'ณัฏฐ์ ชูเดช', 'ณัฐพัชร ผ่องญาติ', 'ธนัสภพ หลิมจานนท์', 'นพดล อมรทรัพย์เจริญ', 'บูรพา ธนทวีรัตน์', 'พีรพัฒน์ โตวัฒน์นิมิต', 'รวิทย์ ผ่านภูวงษ์', 'วชิรวิทย์ วีระสกุล', 'วชิรวิทย์ สังขกุลมาลา', 'วรากร อิงคยะกุล', 'วัชรธร กระจ่างมล', 'สิรภัค จักรวาลวิบูลย์', 'อนาวิล ศิลปศาสตร์', 'อภิวิชญ์ บุญคง']]
nameList6 = [["นางสาว	กานต์รวี	แย้มจะบก", "นางสาว	ณัชชา	แสงแก้ว", "นางสาว	ณัฐชยาพร	หาญธำรงวิทย์", "นางสาว	ปัฐนิช	วิบูลสวัสดิ์วัฒนา", "นางสาว	ภัณฑิรา	ศิริบรรณากุล", "นางสาว	ภาราดา	โพยนอก", "นางสาว	วีรินทร์	บรรจงปรุ", "นางสาว	สินีนาฏ	ขำสุข", "นาย	ชัยวิชญ์	จุนแสงจันทร์", "นาย	ฐิติวัชร์	จันทรคณาพัฒน์", "นาย	ณัฐชานนท์	โสนุช", "นาย	ณัทโชค	อินทรกำแหง", "นาย	ธนธร	งานสุจริต", "นาย	ธนพัฒน์	รีชีวะ", "นาย	ธิติพัทธ์	อินทสุวรรณ", "นาย	พงภวิษย์	หล่อฉัตรนพคุณ", "นาย	ภาวัต	งามภูพันธ์", "นาย	ภูชิสส์กานต์	ปานพรม", "นาย	ภูดิศ	จันทร์อินทร์", "นาย	ภูริ	จรรยาเจริญ", "นาย	ศตวรรษ	วรสายัณห์", "นาย	สุขจิต	ไชยวงศ์", "นาย	เสฎฐวุฒิ	เสวตานนท์", "นาย	อภิชา	ชัยชววุฒิ"]
        ,["นางสาว	กัญญาวีณ์	รัฐศานติบูรณ์", "นางสาว	จินดารัตน์	เลิศคุณลักษณ์", "นางสาว	ธนนันท์	สังข์ประเสริฐ", "นางสาว	นันท์นภัส	วงศ์สว่าง", "นางสาว	นิรามัย	อุดมสถาพันธ์", "นางสาว	ปิยธิดา	ศรัทธาบุญ", "นางสาว	ปุณิกา	หอบรรลือกิจ", "นางสาว	ภาณัชชา	ลิ่มกาญจนโชติ", "นาย	ขัมน์	อรุณศิริวงศ์", "นาย	จิรัฎฐ์	เสาวธารพงศ์", "นาย	ณัฏฐ์กณิษ์	อภิมุขกุญช์", "นาย	ณัฐชนน	สนองคุณวรกุล", "นาย	ณัฐดนัย	สุนันทคันธรส", "นาย	ณัฐดนัย	ศักดาภิพาณิชย์", "นาย	ธนดล	อุทัยสินธุเจริญ", "นาย	ธนวัฒน์	สุขญาติ", "นาย	ธีภพ	วงกตศิลา", "นาย	ปฐมภู	คณาภรณ์ธาดา", "นาย	ปฤณภณ	ปัถยาวิชญ์", "นาย	พศิน	วาทินกล้า", "นาย	พีระพงศ์	ถั่วตุ้น", "นาย	ภรัณยู	ปีตานนท์ชัย", "นาย	สารัทธ์	โชติรุ่งโรจน์", "นาย	โสภณ	พุ่มไสว"]
        ,["นางสาว	ฐานิตา	ฤกษ์ธนะขจร", "นางสาว	จิณณะ	วัยวัฒนะ", "นางสาว	ชญานิษฐ์	ทางรัตนสุวรรณ", "นางสาว	ชิสา	เพชรขจี", "นางสาว	ณภัทรธมนต์	พิเศษกุล", "นางสาว	ณัฐวรา	อุดมลาภสกุล", "นางสาว	ธมล	เตชาทวีวรรณ", "นางสาว	ณตา	พิทักษ์กุลธร", "นาย	กชภาส	ไพศาลนันท์", "นาย	กรภัทร์	ศิริอนันตภัทร์", "นาย	กานต์	สิทธิกัน", "นาย	ไกรวิษย์	ไกยวงศ์", "นาย	จารุวิทย์	เเสงประดับ", "นาย	ชนะภัย	พรมนิยม", "นาย	ณฐนนท์	เสรีลิขิตกุล", "นาย	ณฐพล	ชุณห์กุล", "นาย	ณัช	กอตระกูลสิน", "นาย	ณัชพล	น้อมสูงเนิน", "นาย	ดีดี	ประดิษฐกุล", "นาย	ธรรมนูญ	สรณาคมน์", "นาย	ปุรัณ	ประเสริฐไทย", "นาย	มีเกียรติ	ตั้งสัจจสว่างกุล", "นาย	สุพล	ตั้งศิริพัฒน์", "นาย	โสภณวิชญ์	ปิติวรยุทธ", "นาย	อัครวินท์	ลิ้มพรรัตน์"]
        ,["นางสาว	จีระนุช	สองศรี", "นางสาว	ชลิดา	ปิติมนตรีกุล", "นางสาว	ธันยธรณ์	เตือนวีระเดช", "นางสาว	บุณณดา	อมตานนท์", "นางสาว	เมธาวี	ลีลาเลิศวงศ์", "นางสาว	อคัมย์สิริ	งามสันติชัย", "นางสาว	อักษรินทร์	วงศ์สุทธิเลิศ", "นางสาว	อารีญา	แต้ชูวงศ์", "นาย	จิตรภาณุ	อรุโณทัย", "นาย	ณัฐภัทร	รัตน์ธนารักษ์", "นาย	ไดกิ	ฮาซาม่า", "นาย	ธนาธนิษฐ์	เลิศวิลาศานนท์", "นาย	ธีทัต	อุตวัฒน์", "นาย	นิธิศ	ชัยวีระวัฒนะ", "นาย	ปกรณ์	ศักดิ์ศิริมนตรี", "นาย	ปรมัตถ์	มณีสุธรรม", "นาย	พิชญุตม์	โอภาโส", "นาย	พีรทัตต์	ลาภณรงค์ชัย", "นาย	ภูวณิช	วาณิชวิวัฒน์", "นาย	รัตนกิตติ์	ทองคำอ้น", "นาย	วสภะ	รุ่งฤทัยวัฒน์", "นาย	วิภู	กิจสำเร็จ", "นาย	ศุภสัณห์	เข็มพงษ์", "นาย	สวิส	ไศลบาท"]
        ,["นาย	กุลพัชร	ชนานำ", "นางสาว	กานธ์กนิษฐ์	ลักษณวิศิษฏ์", "นางสาว	จุฑามาศ	รัตนพงษ์วณิช", "นางสาว	ชุติกาญจน์	ผลแก้ว", "นางสาว	ญาณพิชญ์	ธีรฉัตรวัฒน์", "นางสาว	ณิชา	ศรีธนาอุทัยกร", "นางสาว	ธนพร	ไพบูลย์", "นางสาว	ปกิตตา	เกรียงเกษม", "นางสาว	ปรีชญา	นราประเสริฐกุล", "นาย	คุณัชญ์	คงทอง", "นาย	จักรมณฑ์	มากจันทร์", "นาย	ชญานนท์	ไชยานุกิจ", "นาย	ชนกชนม์	เมืองเจริญ", "นาย	ณพงษ์ธร	เจริญลาภ", "นาย	ณภัทร	มาฆะเซ็นต์", "นาย	ณัฐนันท์	กำลังหาญ", "นาย	ธนภูมิ	สมศักดิ์", "นาย	นนทพัทธ์	เชาวน์วรนันท์", "นาย	ปัณณ์	เนตรชลายุทธ", "นาย	ปุณณกริช	การพานิช", "นาย	ปุณยวีร์	บำรุงเกาะ", "นาย	ศุภกร	กล่อมอำภา", "นาย	เศรษฐ์สิริ	สิริธนาดล", "นาย	สหัสวัช	วงศ์ปิยะบวร", "นาย	สุทธิธาร	สุวรรณนพคุณ"]
        ,["นางสาว	กรเกศ	จิรัปปภา", "นางสาว	กานต์พิชชา	สมุทโคดม", "นางสาว	จิรัชญา	เวียงแก้ว", "นางสาว	เฌอปรางค์	วัฒนยนต์กิจ", "นางสาว	ณิชา	ฮาสุวรรณกิจ", "นางสาว	ปริชญา	สิทธิกุล", "นางสาว	แพรวพรรณ	ลี่ดำรงวัฒนากุล", "นางสาว	ภัฐธีรา	รัตนะคุณชัย", "นาย	กิตติพันธ์	บุญไชยธนินท์", "นาย	จักรนรินทร์	ศิลสว่าง", "นาย	ชญานันท์	เจริญสูงเนิน", "นาย	ชินาตะ	กาญจนรุจวิวัฒน์", "นาย	ณธัญญ์	เจือณรงค์ฤทธิ์", "นาย	ณัชพล	วรคุณพิเศษ", "นาย	จีรัชญ์	เต็มเอี่ยมวณิช", "นาย	เตชินท์	กุกำจัด", "นาย	ทักษ์ดนัย	เถาถวิล", "นาย	ปรมะ	ตั้งศิริ", "นาย	พงศกร	กองสกูล", "นาย	พศิน	พรศิวะกุล", "นาย	พิสิษฐ์	สมใจ", "นาย	พีระมิตร	ตัณศุภศิริเวช", "นาย	ยศวัจน์	ตั้งตระกูลวงศ์", "นาย	วีริศ	แซ่ลิ่ว"]
        ,["นางสาว	พรรษนันท์	ทุ่งปรือ", "นางสาว	กมลภัทร	กาญจนธนเศรษฐ", "นางสาว	ชัชชญา	เลิศไกร", "นางสาว	ญาณิน	ศรีสุพพัตพงษ์", "นางสาว	ณัฐณิชา	เสาวลักษณ์สกุล", "นางสาว	ณิชา	โสภานนท์", "นางสาว	นวินดา	วุฒิศักดิ์วรชาติ", "นางสาว	ภารดี	พัฒนโกวิท", "นางสาว	วรรณวนัช	บุญพรานชู", "นาย	กฤษณพัฒน์	พ่วงรักษ์", "นาย	จิรกร	จงรัตนกิจ", "นาย	เจ้าพระยา	บรรจงการ", "นาย	ชวิน	เลิศไสว", "นาย	ชัยภัทร	ขาวงาม", "นาย	ชาคริต	หลวงจันทร์", "นาย	ณัชพล	วงศ์ธนะเกียรติ", "นาย	นิพัทธ์	จันทรพรหมเดช", "นาย	ปรัชญ์	ศิริพราหมนุกูล", "นาย	ภัทรนันท์	ฉางแก้ว", "นาย	ภีมกฤษฏิ์	ภัคสิริศรีโสภณ", "นาย	ภูวรินทร์	นาคจันทึก", "นาย	ศิวกร	ผู้นำพล", "นาย	ศิษฎา	นาคเลื่อน", "นาย	สรวิชญ์	ตันติเจริญวิวัฒน์", "นาย	อธิภัทร	อมรรัตน์ธำรงค์"]
        ,["นางสาว	จาฏุพัจน์	จารุโภคาวัฒน์", "นางสาว	จิรัชญา	เพชรประสิทธิ์", "นางสาว	ชนิตสิรี	อนุมานไพศาล", "นางสาว	ณัจฉรีญา	ศิริพ่วงพิพัฒน์", "นางสาว	ปาณิศา	เอื้อพันธุ์พงศ์", "นางสาว	ปิยนุช	อนันตกิจโสภณ", "นางสาว	สุชัญญา	ชูเกลี้ยง", "นาย	จิรวัฒน์	นาคเสนาธนสิทธิ์", "นาย	ณษพนธ์	พิฑูรมานิต", "นาย	เตชินท์	นงรัตน์", "นาย	ธีรทัศน์	จันทระ", "นาย	นิพิฐพนธ์	สังข์ทอง", "นาย	พสิษฐ์	เหล่าเท้ง", "นาย	ภาสวี	ล้อศรีพัฒน์", "นาย	ภูริช	หลิมพัฒนวงศ์", "นาย	ภูวรัตน์	นาคจันทึก", "นาย	โภไคย	โภคาทรัพย์", "นาย	สหชาติ	ชาติพรหม", "นาย	สิรวิชญ์	อยู่ศิริ", "นาย	สุวิจักขณ์	เบญจสัตย์กุล", "นาย	หาญชัย	นนท์ประสาท", "นาย	อัฑฒกิตติ์	สาวนะชัย", "นาย	อาชาไนย	ยกสมบัติ"]
        ,["นางสาว	เบญญาภา	อติชาติภัสสร", "นางสาว	จิตประภัสสร	เลิศสลัก", "นางสาว	ชลิตา	จุลสัตย์", "นางสาว	นภัส	ธรรมกิจจาธร", "นางสาว	พรชนก	ทรัพย์วัฒนาชัย", "นางสาว	พิชญ์สินี	เลิศปัญจาศรี", "นางสาว	ลภัสรดา	เเย้มสุวรรณรัตน์", "นางสาว	ลลิตภัทร	เกลี้ยงเกลา", "นางสาว	สุรีย์ภรณ์	ฉายานพรัตน์", "นาย	กฤตย์	กิตติชัยดำรง", "นาย	กันตินันท์	ทอธราเมธา", "นาย	จักรภพ	บูรณศิริวงศ์", "นาย	ธนภูมิ	สันติกันต์", "นาย	ธีร์ธวัช	วิรุฬหะรัตน์", "นาย	ปวริศ	ดาวฉาย", "นาย	ปุณยพัฒน์	คุณาธรรม", "นาย	พงศ์วิชญ์	เตติรานนท์", "นาย	พัชรพล	นวเลิศปัญญา", "นาย	พันธวัสส์	จิระเกียรติกุล", "นาย	พุฒิพงศ์	คงนคร", "นาย	ภูมิภาส	น้ำใจดี", "นาย	วรพัทธ์	เจนจิตพรหิรัญ", "นาย	วริทธิ์	วัฒนพลาชัยกูร", "นาย	ศุภกฤต	มณีโรจน์", "นาย	เสกพิสิฐ	เมษะมัต"]
        ,["นางสาว	ฉันท์ชุลี	สุโภภาค", "นางสาว	ณัฐณิชา	หงส์เลิศนภากุล", "นางสาว	ธฤษวรรณ	พิริยาภัทร์", "นางสาว	ปาลิตา	แก้วสนิท", "นางสาว	เปมิกา	ศุภลักษณ์", "นางสาว	พรลภัส	บุญวิชัย", "นางสาว	ลลิตภัทร	ณ อุบล", "นาย	กรวีร์	นิชรานนท์", "นาย	กษิดิศ	ด้วงน้อย", "นาย	ณภัทร	เวชปรีชา", "นาย	ณัฏฐกิตติ์	แซ่โง้ว", "นาย	ณัฐนันท์	ชินวรกิจ", "นาย	ทิวัตถ์	ฉัตรคำ", "นาย	ธรรมปพน	ชีวรุ่งเรืองสกุล", "นาย	ธัชชัย	ธีรสกุลชล", "นาย	ธัมคูณ	นิธีกุลวัฒน์", "นาย	ธีร์ภวินท์	เหมือนเพชร์", "นาย	ปัณณทัต	ปิยะเกศกุล", "นาย	พิชญ์	อารยะรังษี", "นาย	พิชญุตม์	จีระธวัชชัย", "นาย	สมัชญ์	วัฒนไกวัลวงศ์", "นาย	สุวิจักขณ์	ตันวรรณรักษ์", "นาย	อติวิชญ์	สุภัคชูกุล"]]
nameList = [nameList4, nameList5, nameList6]

mailList6 = [['']*25]*10
mailList6[8] = ["s6208055@mwit.ac.th", "jitprapatso.loe_g30@mwit.ac.th", "chalita.jul_g30@mwit.ac.th", "napat.tha_g30@mwit.ac.th", "pohnchanok.sub_g30@mwit.ac.th", "pitchsinee.ler_g30@mwit.ac.th", "lapasrada.yam_g30@mwit.ac.th", "lalitpat.kla_g30@mwit.ac.th", "sureeporn.cha_g30@mwit.ac.th", "krit.kit_g30@mwit.ac.th", "kantinan.tho_g30@mwit.ac.th", "jakkaphob.bur_g30@mwit.ac.th", "tanaphum.san_g30@mwit.ac.th", "teetawat.vir_g30@mwit.ac.th", "pawarit.dao_g30@mwit.ac.th", "poonyapat.kun_g30@mwit.ac.th", "pongwit.tet_g30@mwit.ac.th", "patcharapon.naw_g30@mwit.ac.th", "phanthawas.jir_g30@mwit.ac.th", "puttipong.kon_g30@mwit.ac.th", "phumipas.nam_g30@mwit.ac.th", "voraparth.jen_g30@mwit.ac.th", "warith.vat_g30@mwit.ac.th", "supakrit.man_g30@mwit.ac.th", "sakepisit.may_g30@mwit.ac.th"]

while(True):
    list_of_images = glob.glob('STEMVISION\code\imageprocessing\camimages\*')
    try:
        image_path = max(list_of_images, key=os.path.getctime)
        latest_image_time = time.ctime(os.path.getmtime(image_path))
        images_list_empty = False
    except:
        if(images_list_empty == False):
            images_list_empty = True
            #print("No image")
        continue
    
    if(latest_image_time != last_image_time):
        time.sleep(0.1)
        image_path = max(list_of_images, key=os.path.getctime)
        latest_image_time = time.ctime(os.path.getmtime(image_path))
        last_image_time = latest_image_time

        with io.open(image_path, 'rb') as image_file:
            content = image_file.read()

        # construct an iamge instance
        image = vision.Image(content=content)

        # annotate Image Response
        response = client.text_detection(image=image)  # returns TextAnnotation
        df = pd.DataFrame(columns=['locale', 'description'])

        texts = response.text_annotations
        for text in texts:
            df = df.append(
                dict(
                    locale=text.locale,
                    description=text.description
                ),
                ignore_index=True
            )

        print("---------Image-Text--------")
        try:
            print(str(df['description'][0]))
        except:
            print("found nothing")
            continue

        name = df['description'][0]
        similarity = 0
        similar_name = 'None'
        room = 0
        number = 0
        email = ""
        clas = 0
        for k in range(3):
            for i in range(10):
                for j in range(len(nameList[k][i])):
                    if similarity < fuzz.ratio(name, nameList[k][i][j]):
                        similarity = fuzz.ratio(name, nameList[k][i][j])
                        similar_name = nameList[k][i][j]
                        similar_name = ' '.join(similar_name.split())
                        clas = k + 4
                        room = i + 1
                        number = j + 1
                        email = mailList6[i][j]
        print("----------Result----------")
        print("Similar Name: " + similar_name)
        print("M. " + str(clas) + "/" + str(room) + "\tNumber: " + str(number))
        print("Similarity: " + str(similarity) + "%")
        print("Email: " + email)

"""
        email_sender = '_YOUR_EMAIL_1'
        email_password = 'ykgivwgegernlbch'
        email_receiver = "_YOUR_EMAIL_2"

        ImgFileName = image_path
        with open(ImgFileName, 'rb') as f:
            img_data = f.read()

        msg = MIMEMultipart()
        msg['Subject'] = 'ก๊อกๆๆ พัสดุมาส่งแล้วจ้า'
        msg['From'] = email_sender
        msg['To'] = email_receiver

        text = MIMEText('ชื่อผู้รับพัสดุ: ' + str(similar_name))
        msg.attach(text)
        image = MIMEImage(img_data, name=os.path.basename(ImgFileName))
        msg.attach(image)

        context = ssl.create_default_context()

        s = smtplib.SMTP_SSL('smtp.gmail.com', 465, context=context)
        s.login(email_sender, email_password)
        s.sendmail(email_sender, email_receiver, msg.as_string())"""